<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
      xmlns:ui="http://java.sun.com/jsf/facelets"
      xmlns:h="http://java.sun.com/jsf/html"
      xmlns:odi="http://java.sun.com/jsf/composite/odi">

<ui:composition template="layout.xhtml">

    <ui:define name="slidersmall">

        <div class="custom_slidersmall">
            <h:graphicImage alt="Odisee" library="images" name="sheader_#{state.viewId}.png" width="940" height="134" style="margin-top: -8px;"/>
        </div>

    </ui:define>

    <ui:define name="content">

        <div id="wrapper-content">
            <div id="content" class="clearfix">
                <div id="contentinnermenu">
                    <div class="moduletable_company">
                        <ul class="menu">
                            <li class="item-226">
                                <h:outputLink value="#{facesContext.externalContext.requestContextPath}/kontakt.xhtml">Kontakt</h:outputLink>
                            </li>
                            <li class="item-227">
                                <h:outputLink value="#{facesContext.externalContext.requestContextPath}/impressum.xhtml">Impressum</h:outputLink>
                            </li>
                        </ul>
                    </div>
                    <div id="contentinner">
                        <div class="item-page">
                            <p>
                                <odi:artofcodingUG/><br/>
                                Homannstr. 4b<br/>
                                21075 Hamburg<br/>
                                <br/>
                                Telefon: +49 (0)40 52982023<br/>
                                Email: <odi:contact-email/><br/>
                                <br/>
                                Steuernummer: 311/5840/2780<br/>
                                USt ID: DE815258776<br/>
                                Gesch&auml;ftsf&uuml;hrer: Ralf Bensmann
                                <br/>
                                <br/>
                                V.i.S.d.P.<br/>
                                Herr Ralf Bensmann<br/>
                                Homannstr. 4b<br/>
                                21075 Hamburg<br/>
                                Telefon: +49 40 52982023<br/>
                                Email: <odi:email recipient="ralf"/><br/>
                            </p>
                            <h1>Markenzeichen</h1>
                            <br/>
                            <br/>
                            <br/>
                            <br/>
                            <p>
                                Alle auf dieser Website verwendeten Namen oder Logos f&uuml;r Produkte sind registrierte Warenzeichen, Markenzeichen und Schutzmarken der entsprechenden Eigent&uuml;mer:
                            </p>
                            <ul>
                                <li>OpenOffice&trade; -
                                    <h:outputLink value="http://www.openoffice.org/" target="_blank">Apache Software Foundation</h:outputLink>
                                </li>
                                <li>LibreOffice&trade; -
                                    <h:outputLink value="http://wiki.documentfoundation.org/TDF/Policies/TradeMark_Policy" target="_blank">The Document Foundation</h:outputLink>
                                </li>
                                <li>FreeBSD&trade; -
                                    <h:outputLink value="http://www.freebsd.org/copyright/trademarks.html" target="_blank">The FreeBSD Foundation</h:outputLink>
                                </li>
                                <li>Linux&trade; -
                                    <h:outputLink value="http://www.linuxmark.org/" target="_blank">Linus Torvalds</h:outputLink>
                                </li>
                                <li>UNIX&trade; -
                                    <h:outputLink value="http://www.opengroup.org/" target="_blank">The Open Group</h:outputLink>
                                </li>
                                <li>Oracle&reg; -
                                    <h:outputLink value="http://www.oracle.com/" target="_blank">Oracle</h:outputLink>
                                </li>
                                <li>Apple -
                                    <h:outputLink value="http://www.apple.com/de/legal/trademark/" target="_blank">Apple Inc.</h:outputLink>
                                </li>
                                <li>Windows Logos&reg; -
                                    <h:outputLink value="http://www.microsoft.com/About/Legal/EN/US/IntellectualProperty/Trademarks/EN-US.aspx" target="_blank">Microsoft Corporation</h:outputLink>,
                                    <h:outputLink value="http://www.microsoft.com/About/Legal/EN/US/IntellectualProperty/Trademarks/Usage/Default.aspx" target="_blank">Microsoft Corporation</h:outputLink>
                                </li>
                            </ul>

                            <h1>Rechtliche Hinweise</h1>
                            <br/>
                            <br/>
                            <br/>

                            <odi:imprint-point level="1" heading="1. Haftungsbeschr&auml;nkung">
                                <p>
                                    Die Inhalte dieser Website werden mit gr&ouml;ßtm&ouml;glicher Sorgfalt erstellt. Der Anbieter &uuml;bernimmt jedoch keine Gew&auml;hr f&uuml;r die Richtigkeit, Vollst&auml;ndigkeit und Aktualit&auml;t der bereitgestellten Inhalte. Die Nutzung der Inhalte der Website erfolgt auf eigene Gefahr des Nutzers. Namentlich gekennzeichnete Beitr&auml;ge geben die Meinung des jeweiligen Autors und nicht immer die Meinung des Anbieters wieder. Mit der reinen Nutzung der Website des Anbieters kommt keinerlei Vertragsverh&auml;ltnis zwischen dem Nutzer und dem Anbieter zustande.
                                </p></odi:imprint-point>

                            <odi:imprint-point level="1" heading="2. Externe Links">
                                <p>
                                    Diese Website enth&auml;lt Verkn&uuml;pfungen zu Websites Dritter ("externe Links"). Diese Websites unterliegen der Haftung der jeweiligen Betreiber. Der Anbieter hat bei der erstmaligen Verkn&uuml;pfung der externen Links die fremden Inhalte daraufhin &uuml;berpr&uuml;ft, ob etwaige Rechtsverst&ouml;ße bestehen. Zu dem Zeitpunkt waren keine Rechtsverst&ouml;ße ersichtlich. Der Anbieter hat keinerlei Einfluss auf die aktuelle und zuk&uuml;nftige Gestaltung und auf die Inhalte der verkn&uuml;pften Seiten. Das Setzen von externen Links bedeutet nicht, dass sich der Anbieter die hinter dem Verweis oder Link liegenden Inhalte zu Eigen macht. Eine st&auml;ndige Kontrolle dieser externen Links ist f&uuml;r den Anbieter ohne konkrete Hinweise auf Rechtsverst&ouml;ße nicht zumutbar. Bei Kenntnis von Rechtsverst&ouml;ßen werden jedoch derartige externe Links unverz&uuml;glich gel&ouml;scht.
                                </p>
                            </odi:imprint-point>

                            <odi:imprint-point level="1" heading="3. Urheber- und Leistungsschutzrechte">
                                <p>
                                    Die auf dieser Website ver&ouml;ffentlichten Inhalte unterliegen dem deutschen Urheber- und Leistungsschutzrecht. Jede vom deutschen Urheber- und Leistungsschutzrecht nicht zugelassene Verwertung bedarf der vorherigen schriftlichen Zustimmung des Anbieters oder jeweiligen Rechteinhabers. Dies gilt insbesondere f&uuml;r Vervielf&auml;ltigung, Bearbeitung, Übersetzung, Einspeicherung, Verarbeitung bzw. Wiedergabe von Inhalten in Datenbanken oder anderen elektronischen Medien und Systemen. Inhalte und Rechte Dritter sind dabei als solche gekennzeichnet. Die unerlaubte Vervielf&auml;ltigung oder Weitergabe einzelner Inhalte oder kompletter Seiten ist nicht gestattet und strafbar. Lediglich die Herstellung von Kopien und Downloads f&uuml;r den pers&ouml;nlichen, privaten und nicht kommerziellen Gebrauch ist erlaubt. Die Darstellung dieser Website in fremden Frames ist nur mit schriftlicher Erlaubnis zul&auml;ssig.
                                </p>
                            </odi:imprint-point>

                            <odi:imprint-point level="1" heading="4. Datenschutz">
                                <p>
                                    Durch den Besuch der Website des Anbieters k&ouml;nnen Informationen &uuml;ber den Zugriff (Datum, Uhrzeit, betrachtete Seite) gespeichert werden. Diese Daten geh&ouml;ren nicht zu den personenbezogenen Daten, sondern sind anonymisiert. Sie werden ausschließlich zu statistischen Zwecken ausgewertet. Eine Weitergabe an Dritte, zu kommerziellen oder nichtkommerziellen Zwecken, findet nicht statt. Der Anbieter weist ausdr&uuml;cklich darauf hin, dass die Daten&uuml;bertragung im Internet (z.B. bei der Kommunikation per E-Mail) Sicherheitsl&uuml;cken aufweisen und nicht l&uuml;ckenlos vor dem Zugriff durch Dritte gesch&uuml;tzt werden kann. Die Verwendung der Kontaktdaten des Impressums zur gewerblichen Werbung ist ausdr&uuml;cklich nicht erw&uuml;nscht, es sei denn der Anbieter hatte zuvor seine schriftliche Einwilligung erteilt oder es besteht bereits eine Gesch&auml;ftsbeziehung. Der Anbieter und alle auf dieser Website genannten Personen widersprechen hiermit jeder kommerziellen Verwendung und Weitergabe ihrer Daten.
                                </p>
                            </odi:imprint-point>

                            <odi:imprint-point level="1" heading="5. Besondere Nutzungsbedingungen">
                                <p>
                                    Soweit besondere Bedingungen f&uuml;r einzelne Nutzungen dieser Website von den vorgenannten Nummern 1. bis 4. abweichen, wird an entsprechender Stelle ausdr&uuml;cklich darauf hingewiesen. In diesem Falle gelten im jeweiligen Einzelfall die besonderen Nutzungsbedingungen.
                                </p>
                            </odi:imprint-point>

                            <odi:imprint-point level="1" heading="6. Logdateien des Webservers">
                                <p>
                                    In den Logfiles dieses Webservers und weiteren, integrierten Statistiktools werden automatisch solche Daten gespeichert, die Ihr Browser an uns &uuml;bermittelt. Dazu geh&ouml;ren:
                                </p>
                                <ul>
                                    <li>Browsertyp/ -version</li>
                                    <li>verwendetes Betriebssystem</li>
                                    <li>Referrer URL (die zuvor besuchte Seite)</li>
                                    <li>Hostname des zugreifenden Rechners (IP Adresse)</li>
                                    <li>Uhrzeit der Serveranfrage</li>
                                </ul>
                                <br/>
                                <p>
                                    Diese Daten sind f&uuml;r uns in der Regel nicht bestimmten Personen zuordenbar. Eine Zusammenf&uuml;hrung dieser Daten mit anderen Datenquellen wird nicht vorgenommen, die Daten werden zudem nach einer statistischen Auswertung gel&ouml;scht.
                                </p>
                            </odi:imprint-point>

                            <odi:imprint-point level="1" heading="7. Cookies">
                                <p>
                                    Die Internetseiten verwenden an mehreren Stellen so genannte Cookies. Sie dienen dazu, unser Angebot nutzerfreundlicher, effektiver und sicherer zu machen. Cookies sind kleine Textdateien, die auf Ihrem Rechner abgelegt werden und die Ihr Browser speichert. Die meisten der von uns verwendeten Cookies sind so genannte ?Session-Cookies?. Sie werden nach Ende Ihres Besuchs automatisch gel&ouml;scht. Cookies richten auf Ihrem Rechner keinen Schaden an und enthalten keine Viren. Um dieses Cookies zu l&ouml;schen oder die Cookiebehandlung generell zu ver&auml;ndern, konsultieren Sie bitte die Hilfe Ihres Browser. In der Regel finden sich diese Einstellungen unter Extras -&gt; Einstellungen Datenschutz (Firefox) oder unter Extras -&gt; Internetoptionen -&gt; Datenschutz (Internet Explorer).
                                </p>
                            </odi:imprint-point>

                            <odi:imprint-point level="1" heading="8. Kommentare, Kontaktformular">
                                <p>
                                    Selbstverst&auml;ndlich erfassen und speichern wir solche Informationen, die Sie auf unseren Webseiten eingeben oder uns in sonstiger Weise &uuml;bermitteln. Das betrifft etwa Kommentare, Namen, Email-Adressen und URLs, die Sie in die entsprechenden Kommentarfelder eintragen. Diese Angaben geschehen freiwillig und werden in keiner Weise &uuml;berpr&uuml;ft, die Verwendung von Pseudonymen etc. ist m&ouml;glich. Wir weisen darauf hin, dass Name, angegebene Webseite und Kommentare f&uuml;r jeden Benutzer der Seite einzusehen sind. Zur Spamvermeidung kann jeder Kommentar zeitweise (vor der Freigabe und Anzeige in diesem Blog) von uns oder einem Drittanbieter automatisiert &uuml;berpr&uuml;ft werden.
                                </p>
                            </odi:imprint-point>

                            <odi:imprint-point level="1" heading="9. Google">
                            </odi:imprint-point>

                            <odi:imprint-point level="2" heading="9.1 Google Analytics">
                                <p>
                                    Diese Website benutzt Google Analytics, einen Webanalysedienst der Google Inc. ("Google").<br/> Google Analytics verwendet sog. "Cookies", Textdateien, die auf Ihrem Computer gespeichert werden und die eine Analyse der Benutzung der Website durch Sie erm&ouml;glicht. Die durch den Cookie erzeugten Informationen &uuml;ber Ihre Benutzung diese Website (einschließlich Ihrer IP-Adresse) wird an einen Server der Google in den USA &uuml;bertragen und dort gespeichert. Google wird diese Informationen benutzen, um Ihre Nutzung der Website auszuwerten, um Reports &uuml;ber die Websiteaktivit&auml;ten f&uuml;r die Websitebetreiber zusammenzustellen und um weitere mit der Websitenutzung und der Internetnutzung verbundene Dienstleistungen zu erbringen. Auch wird Google diese Informationen gegebenenfalls an Dritte &uuml;bertragen, sofern dies gesetzlich vorgeschrieben oder soweit Dritte diese Daten im Auftrag von Google verarbeiten. Google wird in keinem Fall Ihre IP-Adresse mit anderen Daten der Google in Verbindung bringen. Sie k&ouml;nnen die Installation der Cookies durch eine entsprechende Einstellung Ihrer Browser Software verhindern; wir weisen Sie jedoch darauf hin, dass Sie in diesem Fall gegebenenfalls nicht s&auml;mtliche Funktionen dieser Website voll umf&auml;nglich nutzen k&ouml;nnen.<br/> Durch die Nutzung dieser Website erkl&auml;ren Sie sich mit der Bearbeitung der &uuml;ber Sie erhobenen Daten durch Google in der zuvor beschriebenen Art und Weise und zu dem zuvor benannten Zweck einverstanden.<br/> Bitte informieren Sie sich diesbez&uuml;glich unter unseren Allgemeinen Gesch&auml;ftsbedingungen. Bitte ber&uuml;cksichtigen Sie zus&auml;tzlich Googles Datenschutzerkl&auml;rung.
                                </p>
                            </odi:imprint-point>

                            <odi:imprint-point level="2" heading="9.2. Google Adsense / Werbeanzeigen">
                                <p>
                                    Auf dieser Website nutzen wir den Google Adsense Service, um themenbezogenen Werbeanzeigen zu schalten. Ihr Browser speichert eventuell ein von Google Inc. gesendetes Cookie. Die dort gespeicherten Informationen (niemals pers&ouml;nliche Daten wie Name, Adresse, E-Mail-Adresse etc.) &uuml;ber Ihren Besuch sowohl auf dieser, als auch auf anderen Websites, kann dazu genutzt werden, um weitere Anzeigen zu Produkten und Diensten anzuzeigen, die Sie m&ouml;glicherweise interessieren. Falls Sie mehr &uuml;ber diese Methoden erfahren m&ouml;chten oder wissen m&ouml;chten, welche M&ouml;glichkeiten Sie haben, damit diese Informationen nicht von Google Inc. verwendet werden kann, klicken Sie hier.
                                </p>
                            </odi:imprint-point>

                            <odi:imprint-point level="1" heading="10. Facebook">
                                <p>
                                    Diese Website verwendet Social Plugins ("Plugins") des sozialen Netzwerkes facebook.com, welches von der Facebook Inc., 1601 S. California Ave, Palo Alto, CA 94304, USA betrieben wird ("Facebook"). Die Plugins sind mit einem Facebook Logo oder dem Zusatz ?Facebook Social Plugin? gekennzeichnet. Wenn Sie eine Blogseite aufrufen, die ein solches Plugin enth&auml;lt, baut Ihr Browser eine direkte Verbindung mit den Servern von Facebook auf. Der Inhalt des Plugins wird von Facebook direkt an Ihren Browser &uuml;bermittelt und von diesem in die Webseite eingebunden.<br/> Durch die Einbindung der Plugins erh&auml;lt Facebook die Information, dass Sie die entsprechende Seite aufgerufen haben. Sind Sie bei Facebook eingeloggt kann Facebook den Besuch Ihrem Facebook-Konto zuordnen. Wenn Sie mit den Plugins interagieren, zum Beispiel den "Gef&auml;llt mir" Button bet&auml;tigen oder einen Kommentar abgeben, wird die entsprechende Information von Ihrem Browser direkt an Facebook &uuml;bermittelt und dort gespeichert. Zweck und Umfang der Datenerhebung und die weitere Verarbeitung und Nutzung der Daten durch Facebook sowie Ihre diesbez&uuml;glichen Rechte und Einstellungsm&ouml;glichkeiten zum Schutz Ihrer Privatssph&auml;re entnehmen Sie bitte den Datenschutzhinweisen von Facebook.<br/> Wenn Sie nicht m&ouml;chten, dass Facebook &uuml;ber diese Website Daten &uuml;ber Sie sammelt, m&uuml;ssen Sie sich vor Ihrem Besuch auf unseren Webseiten bei Facebook ausloggen.
                                </p>
                            </odi:imprint-point>

                            <h2>Quellenangaben</h2>
                            <ul>
                                <li>
                                    <h:outputLink value="http://www.juraforum.de/" target="_blank">Juraforum.de - Disclaimer, Gesetze, Urteile, Lexikon</h:outputLink>
                                </li>
                                <li>
                                    <h:outputLink value="http://www.gregel.com/about/datenschutzerklaerung/" target="_blank">gregel.com Datenschutzerkl&auml;rung</h:outputLink>
                                </li>
                                <li>
                                    Beitrag
                                    <h:outputLink value="http://www.gregel.com/8059/facebook-gefaellt-mir-gehoert-in-die-datenschutzerklaerung/" target="_blank">Facebook "Gef&auml;llt mir" geh&ouml;rt in die Datenschutzerkl&auml;rung</h:outputLink>
                                </li>
                            </ul>
                        </div>
                    </div>
                </div>
            </div>
        </div>

    </ui:define>

</ui:composition>

</html>
